[
  {
    "rank": 1,
    "score": 4.732792245357769,
    "content": "ical procedures and hospital operations. But using this \ndata to enable more finely-grained diagnostics and treatments for both individual \npatients and patient populations has proved difficult. Research and deployment have \nbeen slowed by outdated regulations and incentive structures. Poor human-computer \ninteraction methods and the inherent difficulties and risks of  implementing \ntechnologies i",
    "type": "text"
  },
  {
    "rank": 2,
    "score": 4.712975764631042,
    "content": "0,1\n,\"promise in healthcare.61 The reduction or removal of  these obstacles, combined with\"\n,\"innovations still on the horizon, have the potential to significantly improve health\"\n,outcomes and quality of  life for millions of  people in the coming years.\n,The clinical setting\n,\"For decades, the vision of  an AI-powered clinician’s assistant has been a near cliché.\"\n,\"Although there have been succ",
    "type": "table"
  },
  {
    "rank": 3,
    "score": 4.635341962096172,
    "content": "61 The reduction or removal of  these obstacles, combined with \ninnovations still on the horizon, have the potential to significantly improve health \noutcomes and quality of  life for millions of  people in the coming years.\nThe clinical setting\nFor decades, the vision of  an AI-powered clinician’s assistant has been a near cliché. \nAlthough there have been successful pilots of  AI-related technol",
    "type": "text"
  },
  {
    "rank": 4,
    "score": 4.578774567359856,
    "content": ",\"avoid spread of  HIV. The dynamic, uncertain nature of  these networks does pose\"\nuses of AI analytics is in,challenges for AI research.100 Care must also be taken to prevent AI systems from\n,\"reproducing discriminatory behavior, such as machine learning that identifies people\"\ndetecting white collar,\n,\"through illegal racial indicators, or through highly-correlated surrogate factors, such\"\n,\n\"c",
    "type": "table"
  },
  {
    "rank": 5,
    "score": 4.505464651359975,
    "content": "ograms might be able to leverage homeless youth social networks to \nstrategically select peer leaders to spread health-related information, such as how to \navoid spread of  HIV . The dynamic, uncertain nature of  these networks does pose \nchallenges for AI research.100 Care must also be taken to prevent AI systems from \nreproducing discriminatory behavior, such as machine learning that identifies ",
    "type": "text"
  },
  {
    "rank": 6,
    "score": 4.33254671986449,
    "content": "ess and manufacturing processes, or engaging with\"\n,\"privacy advocates or academics outside their walls, these companies viewed privacy as\"\n,\"a compliance activity. Their focus was on avoiding fines or punishments, rather than\"\n,proactively designing technology and adapting practices to protect privacy.\n,\"By contrast, the regulatory environment in the United States and Germany,\"\n,which combined mo",
    "type": "table"
  },
  {
    "rank": 7,
    "score": 4.296112911222336,
    "content": "nishing interpersonal\"\n,interactions (entertainment). The report begins with a reflection on what constitutes\n,\"Artificial Intelligence, and concludes with recommendations concerning AI-related\"\n,policy. These recommendations include accruing technical expertise about AI in\n,government and devoting more resources—and removing impediments—to research\n,\"on the fairness, security, privacy, and societ",
    "type": "table"
  },
  {
    "rank": 8,
    "score": 4.15630594300979,
    "content": "a reflection on what constitutes \nArtificial Intelligence, and concludes with recommendations concerning AI-related \npolicy . These recommendations include accruing technical expertise about AI in \ngovernment and devoting more resources—and removing impediments—to research \non the fairness, security , privacy , and societal impacts of  AI systems.\nContrary to the more fantastic predictions for AI ",
    "type": "text"
  },
  {
    "rank": 9,
    "score": 4.1394672802921235,
    "content": "liance activity . Their focus was on avoiding fines or punishments, rather than \nproactively designing technology and adapting practices to protect privacy .\nBy contrast, the regulatory environment in the United States and Germany , \nwhich combined more ambiguous goals with tough transparency requirements and \nmeaningful enforcement, were more successful in catalyzing companies to view \n138  Polit",
    "type": "text"
  },
  {
    "rank": 10,
    "score": 4.122764505778155,
    "content": "d regulatory regimes will need to be\"\n,adapted to AI innovations or in some cases fundamentally reconfigured according to\nunderinvesting resources,\n,broadly accepted goals and principles.\n,\"The approach in the United States to date has been sector-specific, with oversight\"\nin research on the,\n,by a variety of  agencies. The use of  AI in devices that deliver medical diagnostics and\nsocietal implic",
    "type": "table"
  },
  {
    "rank": 11,
    "score": 4.106195981149432,
    "content": "2003), 169-185.Ethical questions arise \nwhen programming cars to \nact in situations in which \nhuman injury or death is \ninevitable, especially when \nthere are split-second \nchoices to be made about \nwhom to put at risk.\n\n23AI is likely to have an increasing impact on city infrastructure. Accurate predictive \nmodels of  individuals’ movements, their preferences, and their goals are likely to \nemerg",
    "type": "text"
  },
  {
    "rank": 12,
    "score": 4.0412325223029955,
    "content": ", \nfairness, and other impacts of  AI.\nQuestions include: Who is responsible when a self-driven car crashes or an \nintelligent medical device fails? How can AI applications be prevented from unlawful \ndiscrimination? Who should reap the gains of  efficiencies enabled by AI technologies \nand what protections should be afforded to people whose skills are rendered obsolete? \nAs AI becomes integrated ",
    "type": "text"
  },
  {
    "rank": 13,
    "score": 4.0412325223029955,
    "content": "0,1,2\nAI is likely to have an increasing impact on city infrastructure. Accurate predictive,,\n\"models of  individuals’ movements, their preferences, and their goals are likely to\",,\nemerge with the greater availability of  data. The ethical issues regarding such an,,\nemergence are discussed in Section III of  this report.,,\nThe United States Department of  Transportation released a call for propos",
    "type": "table"
  },
  {
    "rank": 14,
    "score": 0.0,
    "content": "ARTIFICIAL INTELLIGENCE\nAND LIFE IN 2030\nONE HUNDRED YEAR STUDY ON ARTIFICIAL INTELLIGENCE | REPORT OF THE 2015 STUDY PANEL | SEPTEMBER 2016\nPREFACE\nThe One Hundred Year Study on \nArtificial Intelligence, launched \nin the fall of  2014, is a long-\nterm investigation of  the field of  \nArtificial Intelligence (AI) and \nits influences on people, their \ncommunities, and society . It \nconsiders the sc",
    "type": "text"
  },
  {
    "rank": 15,
    "score": 0.0,
    "content": "e immediately prior report, \nenvisions the potential advances that lie ahead, and describes the technical and \nsocietal challenges and opportunities these advances raise, including in such arenas as \nethics, economics, and the design of  systems compatible with human cognition. The \noverarching purpose of  the One Hundred Year Study’s periodic expert review is to \nprovide a collected and connected",
    "type": "text"
  },
  {
    "rank": 16,
    "score": 0.0,
    "content": "systems broadly benefit individuals and society .1 \nThe One Hundred Year Study is modeled on an earlier effort informally known as \nthe “ AAAI Asilomar Study .” During 2008-2009, the then president of  the Association \nfor the Advancement of  Artificial Intelligence (AAAI), Eric Horvitz, assembled a \ngroup of  AI experts from multiple institutions and areas of  the field, along with \nscholars of  ",
    "type": "text"
  },
  {
    "rank": 17,
    "score": 0.0,
    "content": "report on the intensive \nmeeting discussions, amplified by the participants’ subsequent discussions with other \ncolleagues, generated widespread interest and debate in the field and beyond. \nThe impact of  the Asilomar meeting, and important advances in AI that included \nAI algorithms and technologies starting to enter daily life around the globe, spurred \nthe idea of  a long-term recurring study ",
    "type": "text"
  },
  {
    "rank": 18,
    "score": 0.0,
    "content": "One Hundred Year \nStudy’s periodic expert \nreview is to provide a \ncollected and connected \nset of reflections about  \nAI and its influences as  \nthe field advances.\n\n2extended deep thought and cross-disciplinary scholarly investigations that could \ninspire innovation and provide intelligent advice to government agencies and industry .\nThis report is the first in the planned series of  studies tha",
    "type": "text"
  },
  {
    "rank": 19,
    "score": 0.0,
    "content": "xperts in AI from academia, corporate laboratories \nand industry , and AI-savvy scholars in law, political science, policy , and economics, \nwas launched in mid-fall 2015. The participants represent diverse specialties and \ngeographic regions, genders, and career stages. \nThe Standing Committee extensively discussed ways to frame the Study Panel \ncharge to consider both recent advances in AI and p",
    "type": "text"
  },
  {
    "rank": 20,
    "score": 0.0,
    "content": "ing or natural language processing, and studying particular \napplication areas such as healthcare or transportation. The committee ultimately \nchose a thematic focus on “ AI and Life in 2030” to recognize that AI’s various uses \nand impacts will not occur independently of  one another, or of  a multitude of  other \nsocietal and technological developments. Acknowledging the central role cities have",
    "type": "text"
  }
]